# MissingParent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeyBasedTreeEntryFailures..::..MissingParent Property
BuiltInFailures..::..KeyBasedTreeEntryFailures Class See Also
---
No parent [EntryType] '[Code]' for '[Code]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MissingParent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MissingParent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MissingParent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace